
"""
[문제]
  1. 각 나무꾼은 1,2,...,N은 각 도끼를 연못에 빠뜨림
  2. i번째 나무꾼이 "A_i번째 도끼 소유자임."이라고 함.
  3. 동시에 연못의 신은 i번째 도끼가 B_i번째 나무꾼의 것인 걸 알음.
  4. 모든 나무꾼이 진실이라면 Yes, 아니면 No를 출력하라.

[입력]
  [첫번째 줄] 나무꾼 명수 : N (100명 이하)
  [두번째 줄] 인덱스가 i면, i번째 나무꾼이 소유한 도끼번호 A_i (N개)
  [세번째 줄] 인덱스가 i면, i번째 도끼의 주인인 나무꾼의 번호 B_i (N개)

[수정할 점]
  1. 인덱스 굳이 0에서 시작하기 힘드니까, A_i, B_i 맨 앞에 더미데이터 넣자. (가령 0)
  2. 그러면 0부터가 아니고 1부터 n+1까지라 바꾸고, B_i[i] 그대로 쓸 수 있음. i+1가 아니고 i로도.
  3. for-else 문으로 is_truth라는 플래그를 안 세워도 됌.  
"""

n = int(input())
A_i = [0] + list(map(int, input().split()))
B_i = [0] + list(map(int, input().split()))
is_truth = 1

for i in range(1, n+1) :
    if A_i[B_i[i]] != i :
        print("No")

else : print("Yes")

#[실행결과] AC